In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
df = pd.read_csv("E:\测试\jupyter\df2.csv")

In [7]:
df.head()

  Unnamed: 0    0     1       2    3              4       5
0      Name:   21  项目名称   Name:   22           项目名称   Name:
1        20,   序号   机械臂     21,   序号  飞行升力的控制以及数值显示     22,
2     dtype:   22   NaN  dtype:   23            NaN  dtype:
3     object  NaN   NaN  object  NaN            NaN  object

In [5]:
df.size

28

In [6]:
df

  Unnamed: 0    0     1       2    3              4       5
0      Name:   21  项目名称   Name:   22           项目名称   Name:
1        20,   序号   机械臂     21,   序号  飞行升力的控制以及数值显示     22,
2     dtype:   22   NaN  dtype:   23            NaN  dtype:
3     object  NaN   NaN  object  NaN            NaN  object

In [11]:
df['5'] = df['5'].apply(str.upper)

In [12]:
df

  Unnamed: 0    0     1       2    3              4       5
0      Name:   21  项目名称   Name:   22           项目名称   NAME:
1        20,   序号   机械臂     21,   序号  飞行升力的控制以及数值显示     22,
2     dtype:   22   NaN  dtype:   23            NaN  DTYPE:
3     object  NaN   NaN  object  NaN            NaN  OBJECT

In [ ]:
#通过split进行分割，返回为列表